// 播放对应音频
function reply(str)
{
	var common_head = "./sound/";
	var mp3 = common_head + str;
	var mp3 = new Audio(mp3);
	mp3.play(); //播放 mp3这个音频对象
}

// 点击发送按钮
function send_info()
{
	//alert(window.location.pathname);
	// 获取输入框内容
	var info = document.getElementById('info').value;
	document.getElementById('info').value = "";
	
	// sound下音频文件路径二维数组
	var reply_info = [
		["1-1/不能中止命令,我就是这样被制造的.mp3", "1-1/初次见面,我是玩赏用人造天使.mp3", "1-1/-对卡片的解释.mp3",
	"1-1/铭刻开始.mp3", "1-1/什么都可以.mp3", "1-1/是的.mp3", "1-1/无法中止命令.mp3", "1-1/早上好,主人.mp3"
		],
		["1-2/不，没事的.mp3", "好的，主人2.mp3", "1-2/好的-主人.mp3", "1-2/那主人，这个给你.mp3", "1-2/胖次是吗。。。.mp3",
		"1-2/是的，这张卡片自动结束了，已经没事了.mp3", "1-2/锁链的应对措施.mp3", "1-2/遇到麻烦了吗，主人.mp3", "1-2/主人？.mp3"
		],
		["1-3/对不起.mp3", "好的，主人.mp3", "1-3/好的，主人2.mp3", "1-3/好的，主人3.mp3", "1-3/开心？开心.mp3", "1-3/是的.mp3",
		"1-3/是的2.mp3", "1-3/是的3.mp3", "1-3/我和主人在一起，怎么说呢，心有种轻飘飘的感觉.mp3", "1-3/我吗.mp3",
		"1-3/我是以24马赫的速度飞过去的.mp3", "1-3/这是作业.mp3", "1-3/主人和我一起开心吗.mp3", "1-3/主人为什么在笑呢.mp3"
		],
		["1-4/但是，主人他.mp3", "1-4/朋友？我没有朋友.mp3", "1-4/在家里面.mp3", "1-4/主人遇到麻烦了.mp3"
		],
		["1-5/好的，主人.mp3", "1-5/好的，主人2.mp3", "1-5/好的.mp3", "1-5/在的，主人.mp3"
		],
		["1-6/啊.mp3", "诶.mp3", "1-6/嗯？.mp3", "1-6/那个，这个翅膀是可变式羽翼.mp3", "1-6/那个，主人，睡觉是怎么一回事.mp3",
		"1-6/是.mp3", "1-6/是2.mp3", "1-6/是3.mp3", "1-6/是4.mp3", "1-6/是5.mp3", "1-6/一直在主人身旁，在主人睡醒前，一直.mp3",
		"1-6/这样吗，主人.mp3"
		],
		["1-7/没事的，人的背后有看不见的，很大的翅膀.mp3", "1-7/是，主人.mp3", "1-7/是，主人2.mp3", "1-7/是，主人3.mp3",
		"1-7/是.mp3", "1-7/这些话是什么，不知道是什么意思却很让人在意.mp3"
		],
		["1-8/不，没想到自己也.mp3", "1-8/诶？.mp3", "1-8/没事的.mp3", "1-8/是，主人.mp3", "1-8/是.mp3",
		"1-8/我是玩赏用天使，我要回到主人的身边.mp3", "1-8/主人明明叫我安静待着的，主人.mp3"
		],
		["1-9/人类是说谎的生物，我是普通的人类.mp3", "1-9/是.mp3", "1-9/我什么也不知道.mp3", "1-9/我是，人类.mp3",
		"1-9/我想在主人身边，从今往后.mp3", "1-9/要更像人类才行.mp3"
		],
		["1-10/fallen_down.mp3", "1-10/班上的朋友怎么都拜托我帮忙.mp3", "1-10/不，是因为大家的演奏，我才能唱的.mp3",
		"1-10/对不起，主人.mp3", "1-10/对了，加油努力，让主人表扬我的话，肯定.mp3", "1-10/欢迎光临，主人.mp3",
		"1-10/没什么.mp3", "1-10/妮姆芙，这里的天空很广阔哦.mp3", "1-10/我是主人最讨厌的，兵器.mp3",
		"1-10/我也想牵主人的手.mp3", "1-10/我一点都帮不上主人的忙.mp3", "1-10/怎样才能牵主人的手呢.mp3",
		"1-10/这样真的好吗，过得幸福.mp3"
		],
		["1-11/非常可爱哦，主人.mp3", "1-11/没那回事.mp3", "1-11/是.mp3", "1-11/说谎不行吗.mp3", "1-11/我很高兴，楚原把我当普通人来对待.mp3",
		"1-11/我是主人最讨厌的兵器，这样瞒住主人真的好吗.mp3", "1-11/我有事情瞒着主人.mp3", "1-11/我有重要的事情要说.mp3",
		"1-11/要找主人说出真相才行.mp3", "1-11/这是主人的命令呢.mp3", "1-11/主人！.mp3", "1-11/主人，请.mp3", "1-11/主人在想些什么呢.mp3"
		],
		["1-12/（看见主人和妮姆芙牵手）.mp3", "1-12/niali.mp3", "1-12/nidali.mp3", "1-12/nigoli.mp3", "1-12/并且最近，一直在为什么烦恼的样子.mp3",
		"1-12/不，还没有.mp3", "1-12/不简单，因为，我从没见过，妮姆芙你笑过.mp3", "1-12/赤色的花，白色的花.mp3", "1-12/从来没有看到过.mp3",
		"1-12/从前，一直，没看到，妮姆芙，笑过.mp3", "1-12/动力炉，好疼.mp3", "1-12/动力炉百分比机能正常.mp3", "1-12/对不起，主人.mp3",
		"1-12/呃.mp3", "1-12/诶.mp3", "1-12/诶2.mp3", "1-12/恩.mp3", "1-12/恩？.mp3", "1-12/好不容易的约会，我一点也没有笑.mp3", "1-12/呵嗯.mp3",
		"1-12/和主人的约会很开心，但总感觉不对劲.mp3", "1-12/脸很红呦，主人.mp3", "1-12/那是为什么，我也不清楚.mp3", "1-12/是，主人.mp3",
		"1-12/是.mp3", "1-12/是因为我是战斗用的原因.mp3", "1-12/谁知道呢.mp3", "1-12/万岁是吗.mp3", "1-12/为什么，不会笑呢.mp3", 
		"1-12/早上好，主人.mp3", "1-12/怎么回事，我有点跃跃欲试.mp3", "1-12/怎么了吗.mp3", "1-12/这样如何，主人.mp3", "1-12/只要表情？.mp3", 
		"1-12/主人，很开心的样子.mp3", "1-12/主人，他会，感到高兴.mp3", "1-12/主人，他会，感到高兴2.mp3", "1-12/主人，这是.mp3"
		],
		["1-13/（道别）.mp3", "1-13/（惊吓）.mp3", "1-13/（笑）.mp3", "1-13/model空之女王ON.mp3", "1-13/niali.mp3",
		"1-13/type阿尔法，伊卡洛斯，出击.mp3", "1-13/不用，但是.mp3", "1-13/对不起.mp3", "1-13/诶.mp3",
		"1-13/呵嗯.mp3", "1-13/就是，那个，去买个东西.mp3", "1-13/可变式羽翼，限制解除.mp3", "1-13/没什么.mp3",
		"1-13/目标多半是我，我将以主人讨厌的兵器战斗，不能再回到主人的身边，不能再一次.mp3", "1-13/那是？.mp3",
		"1-13/妮姆芙的信号.mp3", "1-13/你醒了吗，主人.mp3", "1-13/是，主人.mp3", "1-13/是.mp3", "1-13/是2.mp3", "1-13/是3.mp3",
		"1-13/是的，昨天一晚上没回来.mp3", "1-13/太好了.mp3", "1-13/我知道.mp3", "1-13/怎么了.mp3", "1-13/这个.mp3",
		"1-13/主人，非常抱歉，一直以来欺骗你.mp3", "1-13/主人.mp3", "主人2.mp3", "1-13/最喜欢你了，我的主人，永别了.mp3"
		],
		["1-14/没事的，不管发生什么，主人还是我的主人，从今往后一直都是.mp3", "1-14/人造天使，翅膀吸水会变重的.mp3",
		"1-14/天降之物F.mp3", "一切正常，主人.mp3", "1-14/泳池被禁止使用，去换衣服了.mp3", "1-14/这是主人的命令.mp3",
		"1-14/主人（关心）.mp3", "1-14/主人，精神不稳定的话，变身会.mp3"
		]
	];
	
	// A
	if(info.indexOf("啊") != -1)
	{
		if(info == "啊？你在说什么")
		{
			//从来没有看到过
			reply(reply_info[11][8]);
			//从前，一直，没看到，妮姆芙，笑过
			reply(reply_info[11][9]);
		}
		else if(info == "啊，焦成一团黑了")
		{
			//对不起
			reply(reply_info[12][7]);
		}
		else if(info == "啊嘞，大家呢")
		{
			//泳池被禁止使用，去换衣服了
			reply(reply_info[13][4]);
		}
		return;
	}
	
	// B
	if(info.indexOf("把") != -1)
	{
		if(info == "把西瓜带回来了吗")
		{
			//是的3
			reply(reply_info[2][7]);
		}
		return;
	}
	
	if(info.indexOf("不") != -1)
	{
		if(info == "不觉得麻烦吗")
		{
			//不，没事的
			reply(reply_info[1][0]);
		}
		else if(info == "不会的是吧")
		{
			//是的2
			reply(reply_info[2][6]);
		}
		else if(info == "不要太在意")
		{
			//好的
			reply(reply_info[4][2]);
		}
		else if(info == "不能勉强说谎哦")
		{
			//说谎不行吗
			reply(reply_info[10][3]);
		}
		return;
	}
	
	if(info.indexOf("拜托") != -1)
	{
		if(info == "拜托你了，伊卡洛斯，救救妮姆芙")
		{
			//type阿尔法，伊卡洛斯，出击
			reply(reply_info[12][5]);
		}
		return;
	}
	
	// C
	
	// D
	
	// E
	
	// F
	
	// G
	
	// H
	
	// I
	
	// J
	
	// K
	
	// L
	
	// M
	
	// N
	
	// O
	
	// P

	// Q
	
	// R
	
	// S
	
	// T
	
	// U
	
	// V
	
	// W
	
	// X
	
	// Y
	
	// Z
	if(info == "早上好") reply(reply_info[7]);
	else if(info == "早上好") reply(reply_info[7]);
	
}